; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite5 - satellite
	instrument13 - instrument
	instrument14 - instrument
	satellite6 - satellite
	instrument15 - instrument
	instrument16 - instrument
	satellite7 - satellite
	instrument17 - instrument
	thermograph0 - mode
	thermograph3 - mode
	thermograph1 - mode
	image2 - mode
	GroundStation0 - direction
	Star5 - direction
	GroundStation1 - direction
	Star4 - direction
	Star2 - direction
	GroundStation3 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument1 thermograph3)
	(supports instrument1 thermograph1)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star4)
	(supports instrument2 thermograph3)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 thermograph3)
	(supports instrument3 image2)
	(calibration_target instrument3 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 Star4)
	(supports instrument5 image2)
	(calibration_target instrument5 Star4)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 thermograph0)
	(supports instrument8 thermograph3)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 Star2)
	(supports instrument9 thermograph1)
	(supports instrument9 thermograph3)
	(supports instrument9 image2)
	(calibration_target instrument9 GroundStation1)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon9)
	(supports instrument10 thermograph3)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 GroundStation1)
	(supports instrument11 thermograph0)
	(supports instrument11 image2)
	(calibration_target instrument11 GroundStation0)
	(calibration_target instrument11 Star5)
	(supports instrument12 thermograph0)
	(calibration_target instrument12 Star5)
	(calibration_target instrument12 GroundStation0)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star4)
	(supports instrument13 thermograph1)
	(supports instrument13 image2)
	(calibration_target instrument13 GroundStation1)
	(supports instrument14 thermograph0)
	(supports instrument14 thermograph3)
	(calibration_target instrument14 GroundStation3)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star4)
	(supports instrument15 thermograph0)
	(calibration_target instrument15 Star4)
	(calibration_target instrument15 GroundStation3)
	(supports instrument16 thermograph0)
	(supports instrument16 thermograph1)
	(supports instrument16 image2)
	(calibration_target instrument16 Star2)
	(on_board instrument15 satellite6)
	(on_board instrument16 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Phenomenon9)
	(supports instrument17 thermograph1)
	(supports instrument17 image2)
	(supports instrument17 thermograph0)
	(calibration_target instrument17 GroundStation3)
	(on_board instrument17 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star5)
)
(:goal (and
	(pointing satellite2 Star2)
	(pointing satellite3 Planet8)
	(pointing satellite4 Planet8)
	(pointing satellite5 Star7)
	(have_image Planet6 thermograph1)
	(have_image Star7 thermograph0)
	(have_image Planet8 image2)
	(have_image Phenomenon9 thermograph0)
	(have_image Planet10 thermograph3)
	(have_image Phenomenon11 thermograph1)
))

)

; plan
1. (turn_to satellite5 groundstation3 star4)
   deleted: (pointing satellite5 star4)
   added: (pointing satellite5 groundstation3)
   goals met: 0 of 10
2. (switch_on instrument14 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument14)
   goals met: 0 of 10
3. (calibrate satellite5 instrument14 groundstation3)
   added: (calibrated instrument14)
   goals met: 0 of 10
4. (turn_to satellite5 planet10 groundstation3)
   deleted: (pointing satellite5 groundstation3)
   added: (pointing satellite5 planet10)
   goals met: 0 of 10
5. (take_image satellite5 planet10 instrument14 thermograph3)
   added: (have_image planet10 thermograph3)
   goals met: 1 of 10
6. (turn_to satellite5 phenomenon9 planet10)
   deleted: (pointing satellite5 planet10)
   added: (pointing satellite5 phenomenon9)
   goals met: 1 of 10
7. (take_image satellite5 phenomenon9 instrument14 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 2 of 10
8. (turn_to satellite5 star7 phenomenon9)
   deleted: (pointing satellite5 phenomenon9)
   added: (pointing satellite5 star7)
   goals met: 3 of 10
9. (turn_to satellite3 groundstation1 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 groundstation1)
   goals met: 3 of 10
10. (turn_to satellite2 star2 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star2)
   goals met: 4 of 10
11. (take_image satellite5 star7 instrument14 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 5 of 10
12. (switch_on instrument9 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument9)
   goals met: 5 of 10
13. (calibrate satellite3 instrument9 groundstation1)
   added: (calibrated instrument9)
   goals met: 5 of 10
14. (turn_to satellite3 phenomenon11 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 phenomenon11)
   goals met: 5 of 10
15. (take_image satellite3 phenomenon11 instrument9 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 6 of 10
16. (turn_to satellite3 planet6 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 planet6)
   goals met: 6 of 10
17. (take_image satellite3 planet6 instrument9 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 7 of 10
18. (turn_to satellite3 planet8 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 planet8)
   goals met: 8 of 10
19. (take_image satellite3 planet8 instrument9 image2)
   added: (have_image planet8 image2)
   goals met: 9 of 10
20. (turn_to satellite4 planet8 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 planet8)
   goals met: 10 of 10
